15rpm_fine_mesh/0.orig/U

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(innerWall|outerWall|bottomWall)"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    "(inlet|outlet)"
    {
        type            cyclic;
    }
    topWall
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 1 0);
        // 1.5 rpm
        omega           0.15707963267948966; // [rad/s], velocity = radius * omega
    }
}


// ************************************************************************* //
